//COMPRESS JOB (5222),'SPRINKLE',CLASS=A,MSGCLASS=A
//COMPRESS EXEC PGM=IEBCOPY
//SYSPRINT DD   SYSOUT=*
//ASM      DD   DISP=SHR,DSN= SYSGEN.FSI.ASM
//OBJ      DD   DISP=SHR,DSN= SYSGEN.FSI.OBJ
//MLIB     DD   DISP=SHR,DSN= SYSGEN.FSI.MLIB
//PLIB     DD   DISP=SHR,DSN= SYSGEN.FSI.PLIB
//LOAD     DD   DISP=SHR,DSN= SYSGEN.FSI.LOAD
//SYSIN    DD   *
 C I=ASM,O=ASM
 C I=OBJ,O=OBJ
 C I=MLIB,O=MLIB
 C I=PLIB,O=PLIB
 C I=LOAD,O=LOAD
/*
